[
    {
      "id": "harvard_finance",
      "title": "Engaging with India’s Top Financial Leaders at Harvard",
      "date": "Harvard University, Boston | 2024",
      "summary": "Attended a prestigious conference at Harvard, engaging with top Indian financial experts and global students from MIT, Boston University, and more, gaining insights into advanced financial strategies.",
      "fullDetails": [
        "Direct Engagement: Attended a conference at Harvard University where I interacted with leading Indian financial experts such as Ashish Chauhan, Devanshu G., Anurag Sinha, Nirmal Jain, Madhusudanan R., Abhishant Pant, Ashutosh Goyal, Dr. Ritesh Malik, and Abhijit Roy.",
        "Global Networking: Connected with vibrant students from Harvard, MIT, Boston University, Northeastern, and Babson—underscoring the value of global collaboration and fresh perspectives in finance.",
        "Key Insights: Gained invaluable firsthand insights into advanced financial strategies that have deepened my comprehension of financial markets and broadened my professional horizons."
      ]
    },
    {
      "id": "harvard_africa",
      "title": "27th Annual Harvard Africa Conference: Beyond Borders",
      "date": "Harvard University, Boston | 2024",
      "summary": "Explored Africa’s evolving financial landscape at Harvard’s Africa Conference, broadening my perspective on global investment and economic strategies.",
      "fullDetails": [
        "Inclusive Exploration: Participated in a session on “Pan-African Financial Systems” at Harvard, which offered a comprehensive look into Africa’s dynamic financial landscape.",
        "Broadened Perspectives: Despite not being African, the inclusive environment allowed me to enhance my approach to global finance and investment decision-making, reinforcing the interconnected nature of world markets.",
        "Strategic Growth: These insights have been instrumental in cultivating a holistic view of finance, driving my passion for international financial markets."
      ]
    },
    {
      "id": "cornell_families",
      "title": "Families in Business Conference 2024, Cornell Tech",
      "date": "Cornell Tech, NYC | 2024",
      "summary": "Participated in the 10th-anniversary celebration of the Families in Business Conference at Cornell Tech, connecting with industry professionals and discussing family enterprise innovations.",
      "fullDetails": [
        "Insightful Panels: Attended the 10th-anniversary celebration at Cornell Tech on Roosevelt Island, featuring dynamic panels and speakers discussing the unique challenges and opportunities in family businesses.",
        "Professional Connection: Engaged with industry professionals, gaining fresh perspectives that will influence my future strategic endeavors.",
        "Celebratory Impact: Contributed to and celebrated a milestone event that underscored innovation in family-owned enterprises."
      ]
    },
    {
      "id": "cornell_entrepreneur",
      "title": "Cornell Entrepreneurship Summit 2024",
      "date": "Verizon Executive Education Center, Cornell Tech | 2024",
      "summary": "Joined visionaries, entrepreneurs, and finance professionals at Cornell’s Entrepreneurship Summit to explore cutting-edge business innovations and startup ecosystems.",
      "fullDetails": [
        "Entrepreneurial Ecosystem: Participated in an inspiring summit at the Verizon Executive Education Center, where visionaries, entrepreneurs, and thought leaders explored innovation and transformative business strategies.",
        "Valuable Insights: Connected with the Cornell community and beyond, gaining ideas and insights that fuel my passion for merging technology with finance.",
        "Changemaker Vibes: Proud to be part of a vibrant ecosystem dedicated to entrepreneurial growth and innovation."
      ]
    },
    {
      "id": "columbia_conference",
      "title": "Conference at Columbia University",
      "date": "Columbia University, NYC | 2024",
      "summary": "Attended expert-led discussions at Columbia University featuring India's Finance Minister and Cornell finance professors, gaining deep insights into global economic trends.",
      "fullDetails": [
        "High-Caliber Interactions: Attended sessions featuring notable leaders such as Finance Minister Nirmala Sitharaman and Cornell alum Finance Professor Amiyatosh Purnanandam.",
        "Deepened Knowledge: Expanded my understanding of domestic economic trends and the broader implications for global finance, enriching my strategic approach."
      ]
    },
    {
      "id": "csis_washington",
      "title": "Conference at CSIS, Washington, D.C.",
      "date": "CSIS, Washington, D.C. | 2024",
      "summary": "Attended high-profile discussions on India's economic policies, global financial stability, and monetary strategies with renowned experts including India's Chief Economic Advisor and IMF Chief Economist.",
      "fullDetails": [
        "Engaged with India's Chief Economic Advisor, V. Anantha Nageswaran; former RBI Deputy Governor, Viral Acharya; and IMF Chief Economist, Marina Mendes Tavares.",
        "Explored global economic trends, inflation control policies, and central banking strategies.",
        "Discussed financial regulations, risk mitigation, and economic resilience in volatile markets."
      ]
    },
    {
      "id": "maan_welfare",
      "title": "Core Member, MAAN Welfare Foundation",
      "date": "April 2021 – Present",
      "summary": "Serving as a core member of MAAN Welfare Foundation, leading initiatives to enhance farmer profitability, provide training, and establish strategic partnerships for impact.",
      "fullDetails": [
        "Program Development: Developed and implemented programs that significantly improved the profitability and well-being of regional farmers.",
        "Training & Education: Designed and delivered training sessions on crop management, marketing, financial management, and technology adoption, empowering local communities.",
        "Advocacy & Outreach: Acted as a spokesperson for the foundation, effectively communicating its mission to the public, donors, and government officials.",
        "Impact Reporting: Prepared detailed reports and presentations for stakeholders, highlighting achievements, challenges, and future opportunities.",
        "Partnership Management: Established and maintained strong partnerships with donors, local organizations, and government agencies to maximize the foundation’s impact."
      ]
    }
  ]
  